/* 
  Localizable.strings
  ownCloudSDK

  Created by Felix Schwarz on 13.03.18.
  Copyright © 2018 ownCloud GmbH. All rights reserved.
*/

/* OCCertificateViewController section titles */
"Subject" = "الموضوع";
"Issuer" = "المُصدِّر";
"Public Key" = "مفتاح عام";
"Extensions" = "امتدادات";
"Fingerprints" = "بصمات الأصابع";

"Validation Status" = "حالة التحقق";
"Hostname" = "اسم المضيف";
"Validation Error" = "خطأ في التحقق";
"User-rejected." = "تم رفض المستخدم.";
"Certificate has issues." = "توجد مشكلات بالشهادة.";
"User-accepted." = "تم قبول المستخدم.";
"No issues found." = "لم يتم العثور على أي مشكلات.";

/* X.509 certificate fields */
"businessCategory" = "فئة العمل";
"commonName" = "اسم عام";
"countryName" = "اسم البلد";
"jurisdictionCountryName" = "اسم بلد الاختصاص";
"jurisdictionLocalityName" = "اسم منطقة الاختصاص";
"jurisdictionStateOrProvinceName" = "اسم ولاية أو مقاطعة الاختصاص";
"localityName" = "اسم المنطقة";
"organizationName" = "اسم المؤسسة";
"organizationalUnitName" = "اسم وحدة المؤسسة";
"stateOrProvinceName" = "اسم الولاية أو المنطقة";

"version" = "إصدار";
"serialNumber" = "رقم التسلسل";
"signatureAlgorithm" = "خوارزمية التوقيع";

"validFrom" = "صالح من تاريخ";
"validUntil" = "صالح حتى";

"keyBytes" = "بايت أساسي";
"keyExponent" = "الأس الرئيسي";
"keyInformation" = "المعلومات الأساسية";
"keySizeInBits" = "الحجم الأساسي بالبت";
